; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-9)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 )
(:init
(on b1 b2)
(ontable b2)
(on b3 b7)
(on b4 b6)
(on b5 b4)
(ontable b6)
(on b7 b9)
(on b8 b3)
(on b9 b1)
(clear b5)
(clear b8)
)
(:goal
(and
(on b3 b5)
(on b4 b7)
(on b5 b6)
(on b6 b9)
(on b7 b2)
(on b8 b4))
)
)

; plan
1. (move-b-to-t b8 b3)
   deleted: (on b8 b3)
   added: (ontable b8) (clear b3)
   goals met: 0 of 6
2. (move-b-to-b b3 b7 b8)
   deleted: (clear b8) (on b3 b7)
   added: (on b3 b8) (clear b7)
   goals met: 0 of 6
3. (move-b-to-b b7 b9 b3)
   deleted: (clear b3) (on b7 b9)
   added: (on b7 b3) (clear b9)
   goals met: 0 of 6
4. (move-b-to-t b9 b1)
   deleted: (on b9 b1)
   added: (ontable b9) (clear b1)
   goals met: 0 of 6
5. (move-b-to-t b1 b2)
   deleted: (on b1 b2)
   added: (ontable b1) (clear b2)
   goals met: 0 of 6
6. (move-b-to-b b7 b3 b2)
   deleted: (clear b2) (on b7 b3)
   added: (on b7 b2) (clear b3)
   goals met: 1 of 6
7. (move-b-to-b b5 b4 b1)
   deleted: (clear b1) (on b5 b4)
   added: (on b5 b1) (clear b4)
   goals met: 1 of 6
8. (move-b-to-b b4 b6 b7)
   deleted: (clear b7) (on b4 b6)
   added: (on b4 b7) (clear b6)
   goals met: 2 of 6
9. (move-t-to-b b6 b9)
   deleted: (clear b9) (ontable b6)
   added: (on b6 b9)
   goals met: 3 of 6
10. (move-b-to-b b5 b1 b6)
   deleted: (clear b6) (on b5 b1)
   added: (on b5 b6) (clear b1)
   goals met: 4 of 6
11. (move-b-to-b b3 b8 b5)
   deleted: (clear b5) (on b3 b8)
   added: (on b3 b5) (clear b8)
   goals met: 5 of 6
12. (move-t-to-b b8 b4)
   deleted: (clear b4) (ontable b8)
   added: (on b8 b4)
   goals met: 6 of 6
